**Using the dataset from this section, can you replace all the subzero grades
with a grade of zero?

In [1]:
import pandas as pd

In [2]:
names = ['Bob','Jessica','Mary','John','Mel'] 
grades = [76,-2,77,78,101]

In [3]:
GradeList = zip(names,grades) # joined to list using zip function

In [4]:
df = pd.DataFrame(data = GradeList,
columns=['Names', 'Grades'])

In [5]:
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [14]:
# filtering out the impossible grades
df.loc[df['Grades'] < 0] # this has filtered out the dataframe # df[df['Grades'] > 0] will work the same

     Names  Grades
1  Jessica      -2

In [15]:
#Using loc for replace 

df.loc[(df['Grades'] < 0,'Grades')] = 0

In [16]:


df

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     101